Revit 2024 API
ParameterTypeId.RbsElecPanelTotalloadLightParam Property
 "Lighting Total Connected"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RbsElecPanelTotalloadLightParam { get; }
Visual Basic
Public Shared ReadOnly Property RbsElecPanelTotalloadLightParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RbsElecPanelTotalloadLightParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace